# <b>Chapter 17: Hierarchical Indexing</b>

## <b>A Multiply Indexed Series</b>

In [518]:
import pandas as pd
import numpy as np
index = [('California', 2000), ('California', 2010), ('New York', 2000), ('New York', 2010), ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956, 18976457, 19378102, 20851820, 25145561]
pop=pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [519]:
# n = pop.unstack()
# n #ValueError: index must be a MultiIndex to unstack, <class 'pandas.core.indexes.base.Index'> was passed
# print(type(pop.index)) #<class 'pandas.core.indexes.base.Index'>

In [520]:
pop.iloc[1]
'''
-This returns a single value (a scalar).
-It directly accesses the second item (index position 1) in the Series.
-So you'll get the population number for the second index, i.e., 37253956.
'''

"\n-This returns a single value (a scalar).\n-It directly accesses the second item (index position 1) in the Series.\n-So you'll get the population number for the second index, i.e., 37253956.\n"

In [521]:
pop.iloc[[1]]
'''
-This returns a Series (not just the value).
-It uses list-based indexing, even if the list has just one element.
So you'll get:
#output:

(California, 2010)    37253956
dtype: int64

This is still a Series, just with one row.
'''

"\n-This returns a Series (not just the value).\n-It uses list-based indexing, even if the list has just one element.\nSo you'll get:\n#output:\n\n(California, 2010)    37253956\ndtype: int64\n\nThis is still a Series, just with one row.\n"

In [522]:
pop[1:3]

(California, 2010)    37253956
(New York, 2000)      18976457
dtype: int64

In [523]:
pop[[i for i in pop.index if i[1] == 2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [524]:
index= pd.MultiIndex.from_tuples(index)
print(index)
# index.ndim  #1
# index.shape #(6,)

index.dtypes
# level_0    object
# level_1     int64
# dtype: object

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

level_0    object
level_1     int64
dtype: object

In [525]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [526]:
print(type(pop.index))

<class 'pandas.core.indexes.multi.MultiIndex'>

In [527]:
pop[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [528]:
pop.loc[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [529]:
pop.loc[(['California', 'Texas'], 2010)]

California  2010    37253956
Texas       2010    25145561
dtype: int64

In [530]:
pop.loc[:, 2000:2010]

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### <b>MultiIndex as Extra Dimension</b>

In [531]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [532]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [533]:
pop.unstack(level=1)

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [534]:
pop.unstack(level=0)

      California  New York     Texas
2000    33871648  18976457  20851820
2010    37253956  19378102  25145561

In [535]:
print(type(pop_df))

<class 'pandas.core.frame.DataFrame'>

In [536]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [537]:
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [538]:
pop_df = pd.DataFrame({'total': pop,'under18': [9267089, 9284094, 4687374, 4318033, 5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [539]:
f_u18=pop_df['under18']/pop_df['total']
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [540]:
s = f_u18.unstack()
print(s,'\n')
n = s.unstack()
print(n,'\n')
x = n.unstack()
print(x,'\n')
print(x.unstack())

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

2000  California    0.273594
      New York      0.247010
      Texas         0.283251
2010  California    0.249211
      New York      0.222831
      Texas         0.273568
dtype: float64

      California  New York     Texas
2000    0.273594  0.247010  0.283251
2010    0.249211  0.222831  0.273568

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

## <b> Methods of MultiIndex Creation</b>

In [541]:
df = pd.DataFrame(np.random.rand(4,2),
                  index = [list('aabb'), [1,2,1,2]],
                  columns=['Data1', 'Data2'])
df

        Data1     Data2
a 1  0.006400  0.817910
  2  0.272350  0.294108
b 1  0.668050  0.979708
  2  0.387444  0.421359

In [542]:
data = {('California', 2000): 33871648,
('California', 2010): 37253956,
('Texas', 2000): 20851820,
('Texas', 2010): 25145561,
('New York', 2000): 18976457,
('New York', 2010): 19378102}

In [543]:
data_series = pd.Series(data)
data_series

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [544]:
pd.Series(data_series).index.names=['states', 'year']
data_series

states      year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [545]:
oo = pd.Series(data).unstack()
oo

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [546]:
oo.dtypes

2000    int64
2010    int64
dtype: object

In [547]:
print(type(oo))

<class 'pandas.core.frame.DataFrame'>

In [548]:
dff = pd.DataFrame({'pop': data})
dff

                      pop
California 2000  33871648
           2010  37253956
Texas      2000  20851820
           2010  25145561
New York   2000  18976457
           2010  19378102

In [549]:
dff.unstack()

                 pop
                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [550]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]]).ndim
#.ndim: 1
#shape: (4,)

#.dtypes:
# level_0    object
# level_1     int64
# dtype: object

1

In [551]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [552]:
pd.MultiIndex.from_product([['a','b'], [1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [553]:
pd.MultiIndex(levels=[['a', 'b'], [1, 2]], codes=[[0, 0, 1, 1], [0, 1, 0, 1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

### <b>MultiIndex for Columns</b>

In [554]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'],
['HR', 'Temp']],
names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  35.8  44.0  37.1  42.0  36.4
     2      38.0  35.9  30.0  36.5  36.0  37.1
2014 1      25.0  37.4  43.0  37.8  28.0  37.9
     2      50.0  37.2  57.0  35.5  21.0  35.6

In [555]:
health_data.dtypes

subject  type
Bob      HR      float64
         Temp    float64
Guido    HR      float64
         Temp    float64
Sue      HR      float64
         Temp    float64
dtype: object

In [556]:
health_data.ndim

2

In [557]:
health_data.shape

(4, 6)

In [558]:
print(type(health_data))

<class 'pandas.core.frame.DataFrame'>

In [559]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      44.0  37.1
     2      30.0  36.5
2014 1      43.0  37.8
     2      57.0  35.5

## <b>Indexing and Slicing a MultiIndex</b>

### <b>Indexing Multiply Indexed Series</b>

In [560]:
data_series

states      year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [561]:
data_series.loc['California']

year
2000    33871648
2010    37253956
dtype: int64

In [562]:
data_series['California']

year
2000    33871648
2010    37253956
dtype: int64

In [563]:
data_series[:, 2000]

states
California    33871648
Texas         20851820
New York      18976457
dtype: int64

In [564]:
data_series[['California', 'Texas']]

states      year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [565]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [566]:
pop.loc['California']

2000    33871648
2010    37253956
dtype: int64

In [567]:
pop['California']

2000    33871648
2010    37253956
dtype: int64

In [568]:
pop['California', 2000]

33871648

In [569]:
pop[:, 2000]

California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [570]:
pop[pop > 22000000]

California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [571]:
pop['California': 'New York']

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [572]:
pop.loc['California': 'New York']

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [573]:
pop.index.names = ['state','year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [574]:
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [575]:
pop['California', 2000]

33871648

In [576]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

### <b>Indexing Multiply Indexed DataFrames</b>

In [577]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  35.8  44.0  37.1  42.0  36.4
     2      38.0  35.9  30.0  36.5  36.0  37.1
2014 1      25.0  37.4  43.0  37.8  28.0  37.9
     2      50.0  37.2  57.0  35.5  21.0  35.6

In [578]:
health_data['Guido', 'HR']

year  visit
2013  1        44.0
      2        30.0
2014  1        43.0
      2        57.0
Name: (Guido, HR), dtype: float64

In [579]:
health_data.iloc[:2, :3]

subject      Bob       Guido
type          HR  Temp    HR
year visit
2013 1      40.0  35.8  44.0
     2      38.0  35.9  30.0

In [580]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        40.0
      2        38.0
2014  1        25.0
      2        50.0
Name: (Bob, HR), dtype: float64

## <b> Rearranging Multi-Indices </b>

### <b>Sorted and Unsorted Indices</b>

In [581]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.298993
      2      0.353680
c     1      0.650355
      2      0.208677
b     1      0.230975
      2      0.157002
dtype: float64

In [582]:
# data['a':'b'] #output: UnsortedIndexError: 'Key length (1) was greater than MultiIndex lexsort depth (0)'

'''
 you're running into the 'UnsortedIndexError' because you're trying to do label-based slicing on a MultiIndex that isn't sorted, and Pandas requires sorted indices for this kind of slice to work properly.
'''

"\n you're running into the 'UnsortedIndexError' because you're trying to do label-based slicing on a MultiIndex that isn't sorted, and Pandas requires sorted indices for this kind of slice to work properly.\n"

In [583]:
data = data.sort_index()
data

char  int
a     1      0.298993
      2      0.353680
b     1      0.230975
      2      0.157002
c     1      0.650355
      2      0.208677
dtype: float64

In [584]:
data['a':'b']

char  int
a     1      0.298993
      2      0.353680
b     1      0.230975
      2      0.157002
dtype: float64

### <b>Stacking and Unstacking Indices</b>

In [585]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [586]:
pop.unstack(level = 0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [588]:
pop.unstack(level = 1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [587]:
pop.unstack()

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [590]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [591]:
print(type(pop))

<class 'pandas.core.series.Series'>

### <b>Index Setting and Resetting</b>

In [592]:
pop_flat= pop.reset_index(name='populations')
pop_flat

        state  year  populations
0  California  2000     33871648
1  California  2010     37253956
2    New York  2000     18976457
3    New York  2010     19378102
4       Texas  2000     20851820
5       Texas  2010     25145561

In [594]:
vv= pop_flat.set_index(['state', 'year'])
vv

                 populations
state      year
California 2000     33871648
           2010     37253956
New York   2000     18976457
           2010     19378102
Texas      2000     20851820
           2010     25145561

In [595]:
print(type(vv))

<class 'pandas.core.frame.DataFrame'>

In [602]:
vv.loc['California', 2000]

populations    33871648
Name: (California, 2000), dtype: int64